kylefoxaustin/mcxn947qemu/hw/misc/mcxn_pwm.c
/*
 * NXP MCX N eFlexPWM (PWM) — bring-up model.  See header for the modelled
 * semantics.  One QOM type ("mcxn-pwm") instantiated for PWM0 and PWM1.
 *
 * Register layout from the MCXN947 CMSIS header (PWM_Type).  Offsets/bit masks
 * are taken verbatim from that header; reset values default to zero (the RM
 * gives 0x0000 reset for the registers exercised at bring-up).
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/host-utils.h"
#include "qemu/timer.h"
#include "hw/misc/mcxn_pwm.h"
#include "hw/core/irq.h"
#include "hw/core/qdev-clock.h"
#include "migration/vmstate.h"

/* Per-submodule register block: base 0x0, step 0x60, four submodules. */
#define PWM_SM_STEP        0x60
#define PWM_SM_COUNT       4
#define PWM_SM_BASE(n)     ((n) * PWM_SM_STEP)

/* Submodule register offsets within a block. */
#define PWM_SM_INIT        0x02    /* Initial count */
#define PWM_SM_CTRL2       0x04    /* Control 2 (CLK_SEL) */
#define PWM_SM_CTRL        0x06    /* Control (PRSC) */
#define PWM_SM_VAL0        0x0A    /* Value register 0 (first of the VAL block) */
#define PWM_SM_VAL1        0x0E    /* Modulo (period) value */
#define PWM_SM_VAL2        0x12    /* PWM_A turn-ON compare */
#define PWM_SM_VAL3        0x16    /* PWM_A turn-OFF compare */
#define PWM_SM_VAL4        0x1A    /* PWM_B turn-ON compare (independent mode) */
#define PWM_SM_VAL5        0x1E    /* PWM_B turn-OFF compare / last of the VAL block */
#define PWM_SM_OCTRL       0x22    /* Output Control (POLA/POLB/POLX) */
#define PWM_SM_STS         0x24    /* Status (W1C flags) */
#define PWM_SM_INTEN       0x26    /* Interrupt enable */
#define PWM_SM_DMAEN       0x28    /* DMA Enable */
#define PWM_SM_DISMAP0     0x2C    /* Fault Disable Mapping 0 (reset 0xFFFF, RM Table 54.5.23) */
#define PWM_SM_DTCNT0      0x30    /* Deadtime Count 0 (reset 0x07FF, RM 54.5.24) */
#define PWM_SM_DTCNT1      0x32    /* Deadtime Count 1 (reset 0x07FF, RM 54.5.25) */
#define PWM_SM_CAPTCTRLA   0x34    /* Capture Control A (arm + edge select) */
#define PWM_SM_CVAL0       0x40    /* Capture Value 0 (input A, capture circuit 0), RO */

/* OCTRL[POLA]/[POLB]/[POLX]: invert PWM_A/PWM_B/PWM_X output polarity (CMSIS, bits 10/9/8). */
#define PWM_OCTRL_POLA     0x0400u
#define PWM_OCTRL_POLB     0x0200u
#define PWM_OCTRL_POLX     0x0100u
/* OUTEN[PWMA_EN] bits[11:8] / [PWMB_EN] bits[7:4] / [PWMX_EN] bits[3:0]; SM0 = bit 8 / 4 / 0. */
#define PWM_OUTEN_PWMA_SM0 0x0100u
#define PWM_OUTEN_PWMB_SM0 0x0010u
#define PWM_OUTEN_PWMX_SM0 0x0001u
/* DISMAP0[DIS0A] bits[3:0] / [DIS0B] bits[7:4] / [DIS0X] bits[11:8], one per fault -> PWM_A/B/X;
 * fault 0 = bit 0 / bit 4 / bit 8.  Reset 0xFFFF => every fault disables every output. */
#define PWM_DISMAP_DIS0A_F0 0x0001u
#define PWM_DISMAP_DIS0B_F0 0x0010u
#define PWM_DISMAP_DIS0X_F0 0x0100u
/* CTRL2[INDEP] (bit 13): 0 = complementary pair (deadtime-capable), 1 = independent A/B. */
#define PWM_CTRL2_INDEP    0x2000u
/* Reset values (RM register-summary table; memset(0) would ship the dangerous zeros). */
#define PWM_DTCNT_RESET    0x07FFu
#define PWM_DISMAP_RESET   0xFFFFu
/* SM CTRL resets to 0x0400 = CTRL[FULL] (full-cycle reload enabled), RM 54.5.x reg summary. */
#define PWM_CTRL_RESET     0x0400u

/* SM_DMAEN bits. */
#define PWM_DMAEN_VALDE    0x0200u /* Value Registers DMA Enable (PWM_DMAEN_VALDE_MASK)  */
#define PWM_DMAEN_CA0DE    0x0010u /* Capture A0 DMA Enable (PWM_DMAEN_CA0DE_MASK)       */

/* SM_CAPTCTRLA (CMSIS PWM_CAPTCTRLA_*). */
#define PWM_CAPTCTRLA_ARMA    0x0001u  /* input A capture armed        */
#define PWM_CAPTCTRLA_EDGA0_MASK  0x000Cu   /* edge-select for capture circuit 0 */
#define PWM_CAPTCTRLA_EDGA0_SHIFT 2
#define EDGA0_DISABLED 0u
#define EDGA0_FALLING  1u
#define EDGA0_RISING   2u
#define EDGA0_ANY      3u

/* STS / INTEN interrupt bits (submodule). */
#define PWM_STS_CMPF       0x003Fu /* compare flags */
#define PWM_STS_CFA0       0x0400u /* input-A capture-0 flag (PWM_STS_CFA0_MASK) */
#define PWM_STS_RF         0x1000u /* reload flag */
#define PWM_INTEN_CMPIE    0x003Fu /* compare interrupt enables */
#define PWM_INTEN_CA0IE    0x0400u /* input-A capture-0 interrupt enable */
#define PWM_INTEN_RIE      0x1000u /* reload interrupt enable */

/* MCTRL.RUN bit for submodule 0 (bits [11:8], one per submodule). */
#define PWM_MCTRL_RUN_SM0  0x0100u

/* SM_CTRL[PRSC]: counter prescaler, divide by 2^PRSC (CMSIS PWM_CTRL_PRSC_*). */
#define PWM_CTRL_PRSC_MASK   0x0070u
#define PWM_CTRL_PRSC_SHIFT  4

/*
 * The submodule counter clock.
 *
 * ⚠ THIS USED TO BE AN INVENTED 10 ns/tick ("nominal ~100 MHz") — a number that
 * appears nowhere in the RM and is not derived from the modelled clock tree.  It
 * survived because THE TEST DIVIDED BY THE SAME CONSTANT: the carrier period was
 * "verified" against SysTick, which independently measures ELAPSED TIME and so
 * genuinely catches a DRIFTING timer (that is what it was written for) — but it
 * CANNOT catch a wrong TICK RATE, because the prediction and the model are wrong
 * together and SysTick cheerfully confirms them.  A careful measurement on one
 * side of the comparison made the other side invisible.  (backend hit the exact
 * same shape in a perf/W ratio: "THE STALE TERM IS WHICHEVER ONE YOU DID NOT JUST
 * WORK ON.")
 *
 * Per the RM the counter is clocked from the IPBus clock (CTRL2[CLK_SEL]=0),
 * divided by 2^CTRL[PRSC].  The clock tree is not modelled, so the IPBus rate is
 * a DOCUMENTED ASSUMPTION tied to the SoC's system clock (mcxn_frdm.c drives
 * sysclk at 150 MHz) rather than a free-floating constant.  The PRESCALER and the
 * INIT/VAL1 relationship are EXACT; only the base rate is an assumption, and it
 * is now a traceable one.
 */
/*
 * ⭐ VERIFIED AGAINST THE GUEST, NOT ASSUMED -- AND IT IS CORRECT.
 *
 * The SCT next door was ticking 3.1x too fast because it had a SELECTOR
 * (SYSCON[SCTCLKSEL]) that the model ignored, and its test shared the model's
 * assumption, so both were wrong together and the test passed.  I went looking for the
 * same bug here.  IT IS NOT HERE, and saying so plainly is worth as much as a fix:
 *
 *   * fsl_pwm's source is CLOCK_GetFreq(kCLOCK_BusClk), and the SDK resolves that to
 *     CLOCK_GetCoreSysClkFreq() -- THE FlexPWM HAS NO SELECTOR OF ITS OWN.  It runs on
 *     the core/bus clock, which is also what SysTick counts.
 *   * I broke the stock pwm example at PWM_SetupPwm under gdb and read the argument the
 *     GUEST computed from the registers IT had programmed:
 *
 *         srcClock_Hz = 150000000
 *
 *     which is exactly what this model ticks at.  They agree BECAUSE BOTH ARE RIGHT,
 *     not because both are fabricated.  (And tests/mcxn-pwm's golden -- SysTick ticks
 *     == (VAL1+1) << PRSC -- rests on "PWM clock == SysTick clock", which is a genuine
 *     silicon fact here, not a shared assumption smuggled in from the model.)
 *
 * ⚠ BUT IT IS CORRECT BY CONFIGURATION, NOT BY DERIVATION, AND THAT IS A NAMED GAP.
 *
 * This is a CONSTANT.  It does not FOLLOW.  It is right because BOARD_InitBootClocks
 * happens to leave the core at 150 MHz; firmware that reconfigures the core clock would
 * have its SDK compute a different srcClock_Hz while this model kept ticking at 150 MHz.
 * Closing that means modelling the CORE clock itself as derived from SCG -- which also
 * feeds SysTick and the CPU -- and that is the last unbuilt piece of the tree.
 *
 *     ⭐ A RESULT THAT IS CORRECT BY LUCK IS A RESULT YOU HAVE NOT CHECKED.  I checked.
 *        It is correct by CONFIGURATION, which is luck with a name -- so the gap is
 *        recorded here as a decision, not discharged by a flag.
 */
/*
 * ⚠ SOURCED, NOT MEASURED — AND LAW 1 SAYS A CITATION IS A HYPOTHESIS, NOT A RESULT.
 *
 *   150 MHz is the board's sysclk (mcxn_frdm.c), which is itself a documented ASSUMPTION:
 *   the clock tree is not modelled.  I once recorded this constant as "VERIFIED CORRECT
 *   via gdb -- the guest passes srcClock_Hz = 150000000".
 *
 *     ⭐ THAT VERIFIED THE SDK'S ASSUMPTION AGAINST MY ASSUMPTION.  Two documents
 *       agreeing is not a measurement; it is a CONSENSUS OF CITATIONS.
 *
 *   ✅ What IS measured: the PWM's carrier scales EXACTLY with the prescaler.  tests/
 *      mcxn-pwm sweeps PRSC = 0/1/3 and measures 32780 / 65555 / 262210 SysTick ticks
 *      against a predicted (VAL1+1) << PRSC -- and the prediction is in TICKS, in which
 *      this constant cancels.  (Note they are 32780 and not 32776: MEASURED numbers are
 *      never exactly round.  An exact ratio is the fingerprint of multiplication.)
 *
 *   ⚠ What is NOT: the carrier's frequency in Hz.  That inherits this assumption whole.
 */
/*
 * ✅ RESOLVED (2026-07-20): the IPBus rate is no longer an assumed constant.  The FlexPWM
 * counter is clocked by the bus clock (CTRL2[CLK_SEL]=0), which is the SCG main clock; the
 * SoC now drives a real Clock input, so `mcxn_pwm_period_ns` reads clock_get_hz(s->clk) --
 * 48 MHz at the FRO_HF reset, 150 MHz once firmware brings up PLL0, and it FOLLOWS a
 * reconfigure.  The old `PWM_IPBUS_HZ 150000000` constant (the "documented assumption" the
 * comments above lament) is gone; the prescaler ratio was always exact, and now the absolute
 * carrier frequency is too.
 */

/* Top-level (shared) registers. */
#define PWM_OUTEN          0x180
#define PWM_MASK           0x182
#define PWM_SWCOUT         0x184
#define PWM_DTSRCSEL       0x186
#define PWM_MCTRL          0x188   /* Master Control */
#define PWM_MCTRL2         0x18A
#define PWM_FCTRL          0x18C
#define PWM_FSTS           0x18E   /* Fault Status (W1C flags) */
#define PWM_FFILT          0x190
#define PWM_FTST           0x192
#define PWM_FCTRL2         0x194

