kylefoxaustin/mcxn947qemu/hw/misc/mcxn_pwm.c
/* MCTRL fields. */
#define PWM_MCTRL_LDOK_MASK    0x000Fu
#define PWM_MCTRL_CLDOK_MASK   0x00F0u
#define PWM_MCTRL_RUN_MASK     0x0F00u

/* STS W1C flag mask (CMPF/CFX/CFB/CFA/RF/REF/RUF). */
#define PWM_STS_W1C_MASK       0x7FFFu
/* FSTS lower W1C fault flags (FFLAG[3:0]). */
#define PWM_FSTS_W1C_MASK      0x000Fu

/* Fault control/status fields (CMSIS PWM_FCTRL / PWM_FSTS), per-fault bit n.
 * FIE/FFLAG occupy bits[3:0]; FAUTO/FFPIN bits[11:8]; FLVL bits[15:12]. */
#define PWM_FCTRL_FIE_MASK     0x000Fu   /* Fault Interrupt Enable [3:0]   */
#define PWM_FCTRL_FAUTO_MASK   0x0F00u   /* Automatic Fault Clearing [11:8] */
#define PWM_FCTRL_FLVL_MASK    0xF000u   /* Fault Level (active level) [15:12] */
#define PWM_FSTS_FFLAG_MASK    0x000Fu   /* Fault Flags (latched, W1C) [3:0] */
#define PWM_FSTS_FFPIN_MASK    0x0F00u   /* Filtered Fault Pins (live, RO) [11:8] */
/* FAULT0 single-bit selectors (the operator-driven input). */
#define PWM_FCTRL_FIE0         0x0001u
#define PWM_FCTRL_FAUTO0       0x0100u
#define PWM_FCTRL_FLVL0        0x1000u
#define PWM_FSTS_FFLAG0        0x0001u
#define PWM_FSTS_FFPIN0        0x0100u

static inline uint32_t pwm_ld16(MCXNPWMState *s, hwaddr off)
{
    return s->regs[off] | ((uint32_t)s->regs[off + 1] << 8);
}

static inline void pwm_st16(MCXNPWMState *s, hwaddr off, uint16_t v)
{
    s->regs[off] = v & 0xff;
    s->regs[off + 1] = (v >> 8) & 0xff;
}

static int64_t mcxn_pwm_period_ns(MCXNPWMState *s);   /* defined below */

/* Submodule-0 reload/compare interrupt: (STS & INTEN) on the IRQ-bearing bits. */
static void mcxn_pwm_update_irq(MCXNPWMState *s)
{
    uint16_t sts = pwm_ld16(s, PWM_SM_STS);
    uint16_t inten = pwm_ld16(s, PWM_SM_INTEN);
    bool active = (sts & inten &
                   (PWM_STS_RF | PWM_STS_CMPF | PWM_STS_CFA0)) != 0;

    qemu_set_irq(s->irq, active);
}

/*
 * The submodule-0 counter's live position at virtual time `now`.
 *
 * The model runs the counter as a periodic reload timer (next_reload_ns is the
 * deadline of the next INIT->VAL1 wrap); it does not store a tick-by-tick count.
 * A capture reads the counter AT the input edge, so reconstruct it from the timing:
 * the fraction of the current period already elapsed, mapped onto [INIT, VAL1].
 * When the counter is not running the position is INIT (its reset value).
 */
static uint16_t mcxn_pwm_counter_now(MCXNPWMState *s, int64_t now)
{
    uint16_t init = pwm_ld16(s, PWM_SM_INIT);
    uint16_t val1 = pwm_ld16(s, PWM_SM_VAL1);
    int64_t period = mcxn_pwm_period_ns(s);
    int64_t remaining, elapsed, span, pos;

    if (period <= 0 || !timer_pending(&s->reload_timer)) {
        return init;
    }
    remaining = s->next_reload_ns - now;
    if (remaining < 0) {
        remaining = 0;
    } else if (remaining > period) {
        remaining = period;
    }
    elapsed = period - remaining;                 /* ns since the counter was at INIT */
    span = (uint16_t)(val1 - init) + 1;           /* INIT..VAL1 inclusive             */
    pos = init + (elapsed * span) / period;        /* linear over the period           */
    if (pos > val1) {
        pos = val1;
    }
    return (uint16_t)pos;
}

/*
 * Submodule-0 value-register DMA request (reload-driven).
 *
 * A DMA-driven FlexPWM control loop (PWM_SetupPwmDMA / the fsl_pwm value-DMA path)
 * arms an eDMA channel at the VALx registers, sets SM0.DMAEN[VALDE], and then never
 * writes the duty-cycle words itself: on every RELOAD the FlexPWM raises the value
 * DMA request (mux source FlexPWM0 Val0 = 43), the eDMA writes the next VALx word(s),
 * and the new duty cycle takes effect at the following reload.  Before this line was
 * wired, VALDE drove nothing -- the request could never assert, and a value-DMA loop
 * that armed a channel and waited for the reload request waited forever.
 *
 * The request is EDGE-driven by the reload event, not a FIFO level: one reload must
 * produce exactly one eDMA minor loop.  We assert here on the reload and DEASSERT
 * when the eDMA's write lands on a VALx register (mcxn_pwm_write), which is the
 * "consumption" that terminates the eDMA service loop after a single minor loop --
 * exactly as a SAI TDR write drops the SAI FIFO request.
 */
static void mcxn_pwm_set_val_dma(MCXNPWMState *s, bool level)
{
    if (level == s->val_dma_lvl) {
        return;
    }
    s->val_dma_lvl = level;
    qemu_set_irq(s->dma_req_val, level);
}

/*
 * Operator-driven CAPTURE on the submodule-0 input-A pin (capture circuit 0).
 *
 * A PWM input pin has no signal source in emulation, so the level is OPERATOR-DRIVEN
 * via the "capture-a-input" QOM property (the same seam as PINT's pin-input / the CMP
 * output).  A transition that matches CAPTCTRLA[EDGA0] (falling / rising / any), while
 * the input is armed (CAPTCTRLA[ARMA]), latches the live counter position into CVAL0,
 * sets STS[CFA0], raises the capture interrupt if INTEN[CA0IE] is set, and -- if
 * DMAEN[CA0DE] is set -- pulses the capture eDMA request (CMSIS FlexPWM0 capture0 = 39).
 * A capture is a one-shot event, so the DMA request goes through the eDMA edge/pulse path
 * (one edge, one minor loop).
 *
 * ⚠ Scope, stated: only input A, capture circuit 0 (CVAL0), of submodule 0 is modelled.
 * Input B/X, capture circuit 1, the capture FIFO watermark (CFAWM) and the edge counter
 * are not -- an honest subset, the single-shot capture the DMA path actually needs.
 */
static void mcxn_pwm_capture_a_edge(MCXNPWMState *s, bool level)
{
    uint16_t capctrl = pwm_ld16(s, PWM_SM_CAPTCTRLA);
    unsigned edgsel = (capctrl & PWM_CAPTCTRLA_EDGA0_MASK) >> PWM_CAPTCTRLA_EDGA0_SHIFT;
    bool rising = level && !s->capa_level;
    bool falling = !level && s->capa_level;
    bool match;

    s->capa_level = level;

    if (!(capctrl & PWM_CAPTCTRLA_ARMA) || edgsel == EDGA0_DISABLED) {
        return;                          /* not armed / capture disabled: ignore */
    }
    match = (edgsel == EDGA0_ANY) ||
            (edgsel == EDGA0_RISING && rising) ||
            (edgsel == EDGA0_FALLING && falling);
    if (!match) {
        return;                          /* wrong edge for the selected mode */
    }

    /* Latch the live counter into CVAL0 (read-only to the guest) and flag it. */
    pwm_st16(s, PWM_SM_CVAL0,
             mcxn_pwm_counter_now(s, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL)));
    pwm_st16(s, PWM_SM_STS, pwm_ld16(s, PWM_SM_STS) | PWM_STS_CFA0);
    mcxn_pwm_update_irq(s);

    if (pwm_ld16(s, PWM_SM_DMAEN) & PWM_DMAEN_CA0DE) {
        qemu_irq_pulse(s->dma_req_capa);
    }
}

