kylefoxaustin/mcxn947qemu/hw/misc/mcxn_pwm.c
static void mcxn_pwm_set_capa(Object *obj, bool value, Error **errp)
{
    mcxn_pwm_capture_a_edge(MCXN_PWM(obj), value);
}

static bool mcxn_pwm_get_capa(Object *obj, Error **errp)
{
    return MCXN_PWM(obj)->capa_level;
}

/* FlexPWM FAULT interrupt: any latched fault flag whose FIE is set asserts
 * FLEXPWMn_FAULT.  FFLAG and FIE are both bits[3:0], so they align directly. */
static void mcxn_pwm_update_fault_irq(MCXNPWMState *s)
{
    uint16_t fsts = pwm_ld16(s, PWM_FSTS);
    uint16_t fctrl = pwm_ld16(s, PWM_FCTRL);
    bool active = (fsts & PWM_FSTS_FFLAG_MASK & fctrl) != 0;

    qemu_set_irq(s->irq_fault, active);
}

/*
 * FlexPWM fault protection -- the safety path that trips motor gate-drive.
 *
 * A FAULT input pin has no signal source in emulation, so FAULT0's level is
 * OPERATOR-DRIVEN via the "fault-input" QOM property (the same seam as the
 * capture-a-input pin / PINT's pin-input / the CMP output).  Per the RM:
 *   - FCTRL[FLVL] picks the ACTIVE level: a fault condition exists when the
 *     (filtered) fault input equals FLVL for that fault.
 *   - FSTS[FFPIN] is a read-only mirror of the live filtered fault input;
 *     FSTS[FFLAG] LATCHES on the fault condition and stays set until cleared.
 *   - FCTRL[FIE] gates the FlexPWM FAULT interrupt (FLEXPWMn_FAULT to the NVIC).
 *   - Clearing FFLAG (W1C) succeeds only once the fault input has returned to
 *     normal -- a LIVE fault CANNOT be cleared (the real safety interlock);
 *     with FCTRL[FAUTO] set the flag clears automatically on return-to-normal.
 *
 * ⚠ Scope, stated: FAULT input 0 is the operator seam (faults 1..3 share the
 * identical per-bit logic but have no injection seam).  The fault's PRIMARY
 * silicon effect -- FORCING THE MAPPED PWM OUTPUTS to their safe state
 * (FCTRL[FSAFE]/DISMAP) -- is NOT modelled, because this model has no output-pin
 * / waveform representation at all (OUTEN/MASK are inert bytes).  What IS modelled
 * is the fault DETECTION + STATUS + INTERRUPT path a driver's fault handler binds
 * to; the output-force-off is a named seam awaiting an output-waveform model.
 */
static void mcxn_pwm_fault_eval(MCXNPWMState *s)
{
    uint16_t fctrl = pwm_ld16(s, PWM_FCTRL);
    uint16_t fsts = pwm_ld16(s, PWM_FSTS);
    bool flvl0 = (fctrl & PWM_FCTRL_FLVL0) != 0;
    bool active = (s->fault_level == flvl0);      /* input matches active level */

    /* FFPIN[0]: read-only mirror of the live (filtered) fault-input level. */
    if (s->fault_level) {
        fsts |= PWM_FSTS_FFPIN0;
    } else {
        fsts &= ~PWM_FSTS_FFPIN0;
    }

    if (active) {
        fsts |= PWM_FSTS_FFLAG0;                  /* latch the fault */
    } else if (fctrl & PWM_FCTRL_FAUTO0) {
        fsts &= ~PWM_FSTS_FFLAG0;                 /* automatic clear on return-to-normal */
    }                                             /* manual mode: stays latched until W1C */

    pwm_st16(s, PWM_FSTS, fsts);
    mcxn_pwm_update_fault_irq(s);
}

static void mcxn_pwm_set_fault(Object *obj, bool value, Error **errp)
{
    MCXNPWMState *s = MCXN_PWM(obj);

    s->fault_level = value;
    mcxn_pwm_fault_eval(s);
}

static bool mcxn_pwm_get_fault(Object *obj, Error **errp)
{
    return MCXN_PWM(obj)->fault_level;
}

/*
 * The submodule-0 PWM_A / PWM_B output levels -- the actual generated waveform, WITH DEAD-TIME.
 *
 * PWM_A's output flip-flop is SET at VAL2 and RESET at VAL3, so its commanded high region is
 * [VAL2, VAL3); the duty cycle (VAL3-VAL2)/(VAL1-INIT+1) is the number motor control is built on.
 * CTRL2[INDEP] chooses how PWM_B is generated:
 *
 *   INDEP=1 (independent): PWM_B has its own compare, [VAL4, VAL5); no dead-time.
 *   INDEP=0 (complementary, the RESET default): PWM_B is the complement of PWM_A, and DEAD-TIME
 *     is inserted -- PWM_A's leading (0->1) edge at VAL2 is delayed by DTCNT0, PWM_B's leading
 *     edge at VAL3 by DTCNT1.  During each delay BOTH outputs are forced inactive: the DEAD BAND
 *     that stops shoot-through through both transistors of an inverter leg.  Without it (DTCNT=0)
 *     the pair overlap and the DC bus is shorted -- which is exactly why DTCNT resets to 0x07FF
 *     (2047 cycles), not 0.  DTCNT is in IPBus cycles regardless of PRSC, so in counter units it
 *     is DTCNT >> PRSC.
 *
 * PWM_X (the auxiliary output) is generated independently of the A/B mode: set at VAL0, reset at
 * VAL1 (high in (VAL0, VAL1)), the RM taking effect at VAL0+1.  OCTRL[POLA/POLB/POLX] invert each
 * output; OUTEN gates whether the PWM drives the pin; a latched FAULT that DISMAP maps to an
 * output forces it inactive (the safety gate-drive cut).  The pins have no on-chip consumer in
 * emulation, so the levels are OPERATOR-OBSERVABLE via read-only "pwm-a/b/x-output" QOM properties
 * (a scope on the pins).  The counter position is reconstructed from timing; when the submodule is
 * not running it is INIT, making the whole thing -- duty, complement, dead band, PWM_X --
 * deterministically testable without racing the carrier.
 *
 * ⚠ Scope, stated: submodule 0; the complementary dead-time path assumes VAL2 < VAL3 (the normal
 * edge/center-aligned config).  FRACVAL fractional-delay dead-time is deliberately NOT modelled:
 * it is not a static sub-count offset but a CROSS-CYCLE DITHER -- FRCTRL[FRACx_EN] makes the
 * accumulated fractional value grow every PWM cycle and add a WHOLE count only every 1/frac cycles
 * (RM 54.3.4.4: "every 4 PWM cycles will be 1 clock cycle longer").  Representing it faithfully
 * needs a running fractional accumulator on the reload path, and observing it needs edge-timing
 * averaged over many cycles -- neither fits this static-position model, and a fixed fractional
 * offset would MISREPRESENT the dither.  Left as an honest seam rather than a plausible fake.
 */
static void mcxn_pwm_outputs(MCXNPWMState *s, bool *a_out, bool *b_out, bool *x_out)
{
    uint16_t fsts = pwm_ld16(s, PWM_FSTS);
    uint16_t dismap = pwm_ld16(s, PWM_SM_DISMAP0);
    uint16_t octrl = pwm_ld16(s, PWM_SM_OCTRL);
    uint16_t outen = pwm_ld16(s, PWM_OUTEN);
    uint16_t ctrl2 = pwm_ld16(s, PWM_SM_CTRL2);
    uint16_t ctrl  = pwm_ld16(s, PWM_SM_CTRL);
    unsigned prsc  = (ctrl & PWM_CTRL_PRSC_MASK) >> PWM_CTRL_PRSC_SHIFT;
    uint16_t val0 = pwm_ld16(s, PWM_SM_VAL0);
    uint16_t val1 = pwm_ld16(s, PWM_SM_VAL1);
    uint16_t val2 = pwm_ld16(s, PWM_SM_VAL2);
    uint16_t val3 = pwm_ld16(s, PWM_SM_VAL3);
    uint16_t pos = mcxn_pwm_counter_now(s, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL));
    bool a, b, x;

    if (ctrl2 & PWM_CTRL2_INDEP) {
        /* Independent channels: A from VAL2/VAL3, B from VAL4/VAL5, no dead-time. */
        uint16_t val4 = pwm_ld16(s, PWM_SM_VAL4);
        uint16_t val5 = pwm_ld16(s, PWM_SM_VAL5);
        a = (val2 <= val3) ? (pos >= val2 && pos < val3) : (pos >= val2 || pos < val3);
        b = (val4 <= val5) ? (pos >= val4 && pos < val5) : (pos >= val4 || pos < val5);
    } else {
        /* Complementary pair with dead-time inserted on each leading edge. */
        uint16_t dead0 = pwm_ld16(s, PWM_SM_DTCNT0) >> prsc;   /* PWM_A 0->1 delay, in counts */
        uint16_t dead1 = pwm_ld16(s, PWM_SM_DTCNT1) >> prsc;   /* PWM_B 0->1 delay, in counts */
        a = (pos >= (uint16_t)(val2 + dead0)) && (pos < val3);
        b = (pos < val2) || (pos >= (uint16_t)(val3 + dead1));
    }

    /* PWM_X: auxiliary output, set at VAL0 (effective at VAL0+1), reset at VAL1. */
    x = (pos > val0) && (pos < val1);

    if (octrl & PWM_OCTRL_POLA) {
        a = !a;
    }
    if (octrl & PWM_OCTRL_POLB) {
        b = !b;
    }
    if (octrl & PWM_OCTRL_POLX) {
        x = !x;
    }
    if (!(outen & PWM_OUTEN_PWMA_SM0)) {
        a = false;
    }
    if (!(outen & PWM_OUTEN_PWMB_SM0)) {
        b = false;
    }
    if (!(outen & PWM_OUTEN_PWMX_SM0)) {
        x = false;
    }
    if (fsts & PWM_FSTS_FFLAG0) {                 /* FAULT force-off (safety) takes precedence */
        if (dismap & PWM_DISMAP_DIS0A_F0) {
            a = false;
        }
        if (dismap & PWM_DISMAP_DIS0B_F0) {
            b = false;
        }
        if (dismap & PWM_DISMAP_DIS0X_F0) {
            x = false;
        }
    }
    *a_out = a;
    *b_out = b;
    *x_out = x;
}

