kylefoxaustin/mcxn947qemu/hw/misc/mcxn_pwm.c
static bool mcxn_pwm_get_a_output(Object *obj, Error **errp)
{
    bool a, b, x;
    mcxn_pwm_outputs(MCXN_PWM(obj), &a, &b, &x);
    return a;
}

static bool mcxn_pwm_get_b_output(Object *obj, Error **errp)
{
    bool a, b, x;
    mcxn_pwm_outputs(MCXN_PWM(obj), &a, &b, &x);
    return b;
}

static bool mcxn_pwm_get_x_output(Object *obj, Error **errp)
{
    bool a, b, x;
    mcxn_pwm_outputs(MCXN_PWM(obj), &a, &b, &x);
    return x;
}

/*
 * Submodule-0 counter period from INIT/VAL1, the CTRL[PRSC] prescaler and the
 * IPBus rate.
 *
 * ⚠ CTRL[PRSC] WAS NOT MODELLED AT ALL.  It is a 3-bit field selecting a divide
 * of 2^PRSC (1..128), and the model ignored it completely: a driver that set
 * PRSC=3 expecting a carrier EIGHT TIMES SLOWER got exactly the same frequency.
 * That is a silent wrong answer in the one number motor control is built on, and
 * it is off by up to 128x.  The test never set PRSC either — it exercised the
 * single configuration in which the bug is invisible (the same degenerate-shape
 * failure as testing a matrix engine only on square matrices).
 */
static int64_t mcxn_pwm_period_ns(MCXNPWMState *s)
{
    uint16_t init = pwm_ld16(s, PWM_SM_INIT);
    uint16_t val1 = pwm_ld16(s, PWM_SM_VAL1);
    uint16_t ctrl = pwm_ld16(s, PWM_SM_CTRL);
    unsigned prsc = (ctrl & PWM_CTRL_PRSC_MASK) >> PWM_CTRL_PRSC_SHIFT;
    int64_t span = (uint16_t)(val1 - init) + 1;   /* counter range, wraps ok */
    int64_t ticks = span << prsc;                 /* 2^PRSC IPBus clocks/count */
    uint32_t hz = s->clk ? clock_get_hz(s->clk) : 0;
    int64_t ns;

    if (hz == 0) {
        return 0;   /* no counter clock (bus clock = 0): the PWM does not run */
    }
    ns = muldiv64(ticks, NANOSECONDS_PER_SECOND, hz);
    return ns < 1000 ? 1000 : ns;                 /* floor to keep it sane */
}

/*
 * One submodule-0 reload: set the reload flag and re-arm.
 *
 * The next deadline is computed from the PREVIOUS DEADLINE, not from "now".
 * Re-arming from the current time re-adds the callback's dispatch latency every
 * single period, so the error ACCUMULATES and the carrier runs systematically
 * slow and drifts — a real PWM carrier does not.  Measuring the period against
 * SysTick (an independent clock) showed the old code running ~8.6% slow; counting
 * interrupts, as this block's test used to, could never have seen it.
 */
static void mcxn_pwm_reload_tick(void *opaque)
{
    MCXNPWMState *s = opaque;

    pwm_st16(s, PWM_SM_STS, pwm_ld16(s, PWM_SM_STS) | PWM_STS_RF);
    mcxn_pwm_update_irq(s);

    /* On a reload, raise the value-register DMA request if the guest enabled it.
     * The eDMA writes the next VALx word(s); that write deasserts it again. */
    if (pwm_ld16(s, PWM_SM_DMAEN) & PWM_DMAEN_VALDE) {
        mcxn_pwm_set_val_dma(s, true);
    }

    {
        int64_t period = mcxn_pwm_period_ns(s);

        if (period <= 0) {
            return;   /* no counter clock -- stop rather than spin at zero period */
        }
        s->next_reload_ns += period;
        timer_mod(&s->reload_timer, s->next_reload_ns);
    }
}

static uint64_t mcxn_pwm_read(void *opaque, hwaddr offset, unsigned size)
{
    MCXNPWMState *s = MCXN_PWM(opaque);
    uint64_t val = 0;
    unsigned i;

    /* Assemble the requested width from the byte-addressable backing. */
    for (i = 0; i < size; i++) {
        if (offset + i < MCXN_PWM_SIZE) {
            val |= (uint64_t)s->regs[offset + i] << (8 * i);
        }
    }
    return val;
}

static void mcxn_pwm_write(void *opaque, hwaddr offset, uint64_t value,
                           unsigned size)
{
    MCXNPWMState *s = MCXN_PWM(opaque);
    unsigned i;
    int n;

    /* Special-case the registers with side effects.  These are all 16-bit and
     * naturally addressed; for sub-register writes fall through to the plain
     * byte store below. */
    if (size == 2 && offset == PWM_MCTRL) {
        uint16_t mctrl = value & 0xffff;
        uint16_t run = mctrl & PWM_MCTRL_RUN_MASK;
        /* RUN bits reflect back so firmware sees the PWM running.  LDOK is a
         * "load OK" request that hardware clears once the buffered registers
         * are loaded; model the load as instantaneous so LDOK reads back 0.
         * CLDOK ("clear LDOK") forces the corresponding LDOK bits to 0. */
        uint16_t cldok = (mctrl & PWM_MCTRL_CLDOK_MASK) >> 4;
        (void)cldok;   /* load is instantaneous, so LDOK is already cleared */
        pwm_st16(s, PWM_MCTRL, run);
        /* Submodule-0 RUN gates the periodic reload timer.  Anchor the first
         * deadline here; every later one is derived from it, so the carrier
         * cannot drift (see mcxn_pwm_reload_tick). */
        if (run & PWM_MCTRL_RUN_SM0) {
            int64_t period = mcxn_pwm_period_ns(s);

            if (period > 0) {
                s->next_reload_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + period;
                timer_mod(&s->reload_timer, s->next_reload_ns);
            } else {
                timer_del(&s->reload_timer);   /* no counter clock: does not run */
            }
        } else {
            timer_del(&s->reload_timer);
        }
        return;
    }

    if (size == 2 && offset < PWM_SM_BASE(PWM_SM_COUNT)) {
        /* Submodule status register: write-1-to-clear. */
        for (n = 0; n < PWM_SM_COUNT; n++) {
            hwaddr sts = PWM_SM_BASE(n) + PWM_SM_STS;
            if (offset == sts) {
                uint16_t cur = pwm_ld16(s, sts);
                cur &= ~((uint16_t)value & PWM_STS_W1C_MASK);
                pwm_st16(s, sts, cur);
                if (n == 0) {
                    mcxn_pwm_update_irq(s);
                }
                return;
            }
        }
    }

    if (size == 2 && offset == PWM_FSTS) {
        uint16_t cur = pwm_ld16(s, PWM_FSTS);
        uint16_t fctrl = pwm_ld16(s, PWM_FCTRL);
        uint16_t blocked = 0;
        uint16_t clr;

        /* A LIVE fault cannot be cleared: if FAULT0 is still in its active state
         * (input == FLVL0), a W1C to FFLAG0 is refused -- the safety interlock,
         * the whole point of the latch.  (Faults 1..3 have no injection seam, so
         * they are never latched and clearing them is a no-op regardless.) */
        if (s->fault_level == ((fctrl & PWM_FCTRL_FLVL0) != 0)) {
            blocked |= PWM_FSTS_FFLAG0;
        }
        clr = (uint16_t)value & PWM_FSTS_W1C_MASK & ~blocked;   /* FFPIN (RO) untouched */
        cur &= ~clr;
        pwm_st16(s, PWM_FSTS, cur);
        mcxn_pwm_update_fault_irq(s);
        return;
    }

