kylefoxaustin/mcxn947qemu/hw/misc/mcxn_pwm.c
    /* Generic byte-addressable store. */
    for (i = 0; i < size; i++) {
        if (offset + i < MCXN_PWM_SIZE) {
            s->regs[offset + i] = (value >> (8 * i)) & 0xff;
        }
    }

    /* A write touching submodule-0 INTEN can change the interrupt condition. */
    if (offset <= PWM_SM_INTEN + 1 && offset + size > PWM_SM_INTEN) {
        mcxn_pwm_update_irq(s);
    }

    /* A write touching FCTRL changes FLVL/FAUTO/FIE: re-evaluate the fault with
     * the current input level (new FLVL may make a steady input a fault; new
     * FAUTO may auto-clear a latched flag; new FIE may (un)gate the interrupt). */
    if (offset <= PWM_FCTRL + 1 && offset + size > PWM_FCTRL) {
        mcxn_pwm_fault_eval(s);
    }

    /* A write landing on submodule-0's VALx block is the eDMA consuming the
     * reload-driven value request: deassert it so the eDMA service loop stops
     * after this single minor loop (see mcxn_pwm_set_val_dma). */
    if (s->val_dma_lvl && offset + size > PWM_SM_VAL0 && offset <= PWM_SM_VAL5 + 1) {
        mcxn_pwm_set_val_dma(s, false);
    }
}

static const MemoryRegionOps mcxn_pwm_ops = {
    .read = mcxn_pwm_read,
    .write = mcxn_pwm_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 1,
    .valid.max_access_size = 4,
    .impl.min_access_size = 1,
    .impl.max_access_size = 4,
};

static void mcxn_pwm_reset(DeviceState *dev)
{
    MCXNPWMState *s = MCXN_PWM(dev);

    int n;

    memset(s->regs, 0, sizeof(s->regs));
    /* RM reset values that are NOT zero -- and where zero is a legal, meaningful, CATASTROPHIC
     * value.  DTCNT0/1 reset to 0x07FF (max dead-time): zero dead-time is a direct short across
     * the DC bus through both transistors of an inverter leg.  DISMAP0 resets to 0xFFFF (every
     * fault disables every output -- the safe default).  memset(0) shipped both dangerous zeros. */
    for (n = 0; n < PWM_SM_COUNT; n++) {
        hwaddr b = PWM_SM_BASE(n);
        pwm_st16(s, b + PWM_SM_CTRL, PWM_CTRL_RESET);
        pwm_st16(s, b + PWM_SM_DTCNT0, PWM_DTCNT_RESET);
        pwm_st16(s, b + PWM_SM_DTCNT1, PWM_DTCNT_RESET);
        pwm_st16(s, b + PWM_SM_DISMAP0, PWM_DISMAP_RESET);
    }
    timer_del(&s->reload_timer);
    qemu_set_irq(s->irq, 0);
    s->val_dma_lvl = false;
    qemu_set_irq(s->dma_req_val, 0);
    s->capa_level = false;
    qemu_set_irq(s->dma_req_capa, 0);
    s->fault_level = false;
    qemu_set_irq(s->irq_fault, 0);
}

static void mcxn_pwm_init(Object *obj)
{
    MCXNPWMState *s = MCXN_PWM(obj);

    /* Bus/IPBus clock input — the SoC connects it to the SCG main clock. */
    s->clk = qdev_init_clock_in(DEVICE(obj), "clk", NULL, NULL, 0);

    /* Operator-driven submodule-0 input-A capture pin:
     *   qom-set /machine/soc/pwm0 capture-a-input true   */
    object_property_add_bool(obj, "capture-a-input",
                             mcxn_pwm_get_capa, mcxn_pwm_set_capa);

    /* Operator-driven FAULT0 input pin (the safety seam):
     *   qom-set /machine/soc/pwm0 fault-input true   */
    object_property_add_bool(obj, "fault-input",
                             mcxn_pwm_get_fault, mcxn_pwm_set_fault);

    /* Operator-OBSERVABLE submodule-0 PWM_A / PWM_B output levels (read-only; the "scope").
     * In complementary mode the dead band shows as BOTH reading false at once:
     *   qom-get /machine/soc/pwm0 pwm-a-output ; qom-get /machine/soc/pwm0 pwm-b-output */
    object_property_add_bool(obj, "pwm-a-output",
                             mcxn_pwm_get_a_output, NULL);
    object_property_add_bool(obj, "pwm-b-output",
                             mcxn_pwm_get_b_output, NULL);
    object_property_add_bool(obj, "pwm-x-output",
                             mcxn_pwm_get_x_output, NULL);
}

static void mcxn_pwm_realize(DeviceState *dev, Error **errp)
{
    MCXNPWMState *s = MCXN_PWM(dev);

    memory_region_init_io(&s->iomem, OBJECT(s), &mcxn_pwm_ops, s,
                          TYPE_MCXN_PWM, MCXN_PWM_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->irq);          /* 0: NVIC reload/compare */
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->dma_req_val);  /* 1: value-register DMA req */
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->dma_req_capa); /* 2: input-A capture DMA req */
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->irq_fault);    /* 3: FLEXPWMn_FAULT to NVIC */
    timer_init_ns(&s->reload_timer, QEMU_CLOCK_VIRTUAL, mcxn_pwm_reload_tick, s);
}

static const VMStateDescription vmstate_mcxn_pwm = {
    .name = TYPE_MCXN_PWM,
    .version_id = 4,
    .minimum_version_id = 4,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT8_ARRAY(regs, MCXNPWMState, MCXN_PWM_SIZE),
        VMSTATE_TIMER(reload_timer, MCXNPWMState),
        VMSTATE_INT64(next_reload_ns, MCXNPWMState),
        VMSTATE_BOOL(val_dma_lvl, MCXNPWMState),
        VMSTATE_BOOL(capa_level, MCXNPWMState),
        VMSTATE_BOOL(fault_level, MCXNPWMState),
        VMSTATE_END_OF_LIST()
    },
};

static void mcxn_pwm_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = mcxn_pwm_realize;
    device_class_set_legacy_reset(dc, mcxn_pwm_reset);
    dc->vmsd = &vmstate_mcxn_pwm;
}

static const TypeInfo mcxn_pwm_types[] = {
    {
        .name          = TYPE_MCXN_PWM,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(MCXNPWMState),
        .instance_init = mcxn_pwm_init,
        .class_init    = mcxn_pwm_class_init,
    },
};

DEFINE_TYPES(mcxn_pwm_types)
